app/controllers/books_controller.rb

INSERT INTO "books" ("address", "city", "created_at", "lastname", "latitude", "longitude", "name", "telephone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "address" = 'Sopot, Wybickiego', "latitude" = 54.4372287, "longitude" = 18.5559972, "updated_at" = '2012-12-13 13:08:19.713874' WHERE "books"."id" = 1
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])