app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 28 Nov 2012 10:30:57 UTC +00:00], ["name", "Robert Tomczak"], ["provider", "twitter"], ["uid", "202667791"], ["updated_at", Wed, 28 Nov 2012 10:30:57 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '202667791' LIMIT 1
---
def create
  auth = request.env["omniauth.auth"]
  user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)